# Cargando librerias

In [1]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ purrr::%||%()   masks base::%||%()
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Usando tidyr, desarrolle los ejercicios siguientes poniendo el respectivo código en la celda correspondiente.

Problema 1

Con respecto al siguiente tibble que representa ventas de pupusas de una cadena de restaurantes en departamentos de El Salvador:

In [2]:
tb1 <- tribble(
  ~departamento, ~marzo, ~abril,
  "La Libertad", 15000, 18000,
  "San Vicente", 12000, 17000,
  "Chalatenango", 9000, 11000,
)

In [3]:
tb1

  departamento marzo abril
1 La Libertad  15000 18000
2 San Vicente  12000 17000
3 Chalatenango  9000 11000

Usando la función apropiada convierta las variables "marzo" y "abril" en una variable que se llame mes.

In [6]:
tb1 |>
  pivot_longer(
    cols = c("marzo", "abril"),
    names_to = "mes",
    values_to = "ventas"
  )

  departamento mes   ventas
1 La Libertad  marzo 15000
2 La Libertad  abril 18000
3 San Vicente  marzo 12000
4 San Vicente  abril 17000
5 Chalatenango marzo  9000
6 Chalatenango abril 11000

Problema 2

Con respecto al siguiente tibble.

In [7]:
tb2 <- data.frame(row = rep(c(1, 2), each = 3),
                 var = c("Height", "Weight", "Age"),
                 value = c(170, 65, 30, 160, 55, 25))

tb2 <- as_tibble(tb2)

In [8]:
tb2

  row var    value
1 1   Height 170
2 1   Weight  65
3 1   Age     30
4 2   Height 160
5 2   Weight  55
6 2   Age     25

Usando la función apropiada genere columnas a partir de la variable var.

In [9]:
tb2 |>
  pivot_wider(
    names_from = var,
    values_from = value
  )

  row Height Weight Age
1 1   170    65     30
2 2   160    55     25